# Taps
tap "homebrew/bundle"

# CLI Tools
brew "cocoapods"
brew "gh"
brew "volta"
brew "watchman"

# Browsers
cask "google-chrome"

# Development Tools
cask "android-studio"
cask "cursor"
cask "expo-orbit"
cask "github"
cask "ngrok"
cask "postman"
cask "visual-studio-code"
cask "zulu@17"

# AI Assistants
cask "chatgpt"
cask "claude"

# Productivity & Utilities
cask "alt-tab"
cask "itsycal"
cask "raycast"
cask "rectangle"
cask "warp"
cask "wispr-flow"

# VPN
cask "nordvpn"

# Communication
cask "telegram"

# Fonts
cask "font-jetbrains-mono-nerd-font"

# VS Code Extensions
vscode "anthropic.claude-code"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "openai.chatgpt"
vscode "orta.vscode-jest"
vscode "pflannery.vscode-versionlens"
vscode "streetsidesoftware.code-spell-checker"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
